micronaut135/load_test_result.txt
./load_test.sh
ENDPOINT: http://127.0.0.1:8080/helloWorld
==> Simple request
HTTP/1.1 200 OK
Date: Fri, 22 May 2020 06:05:48 GMT
connection: keep-alive
content-length: 11
content-type: application/json

Request # 1

==> First load

Summary:
  Total:    4.9380 secs
  Slowest:  0.2632 secs
  Fastest:  0.0002 secs
  Average:  0.0047 secs
  Requests/sec: 20251.1945

  Total data:   1488900 bytes
  Size/request: 14 bytes

Response time histogram:
  0.000 [1] |
  0.026 [94430] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.053 [3628]  |■■
  0.079 [1100]  |
  0.105 [481]   |
  0.132 [179]   |
  0.158 [124]   |
  0.184 [39]    |
  0.211 [11]    |
  0.237 [6] |
  0.263 [1] |


Latency distribution:
  10% in 0.0003 secs
  25% in 0.0005 secs
  50% in 0.0009 secs
  75% in 0.0020 secs
  90% in 0.0072 secs
  95% in 0.0304 secs
  99% in 0.0735 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0002 secs, 0.2632 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0493 secs
  resp wait:    0.0046 secs, 0.0001 secs, 0.2628 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0465 secs

Status code distribution:
  [200] 100000 responses



==> Second request

Summary:
  Total:    2.1005 secs
  Slowest:  0.1462 secs
  Fastest:  0.0001 secs
  Average:  0.0019 secs
  Requests/sec: 47608.0575

  Total data:   1600000 bytes
  Size/request: 16 bytes

Response time histogram:
  0.000 [1] |
  0.015 [96744] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.029 [2466]  |■
  0.044 [551]   |
  0.059 [114]   |
  0.073 [58]    |
  0.088 [32]    |
  0.102 [15]    |
  0.117 [7] |
  0.132 [3] |
  0.146 [9] |


Latency distribution:
  10% in 0.0002 secs
  25% in 0.0003 secs
  50% in 0.0004 secs
  75% in 0.0009 secs
  90% in 0.0030 secs
  95% in 0.0058 secs
  99% in 0.0285 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0001 secs, 0.1462 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0280 secs
  resp wait:    0.0017 secs, 0.0001 secs, 0.1451 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0509 secs

Status code distribution:
  [200] 100000 responses



==> Third request

Summary:
  Total:    1.9011 secs
  Slowest:  0.0778 secs
  Fastest:  0.0001 secs
  Average:  0.0017 secs
  Requests/sec: 52601.1482

  Total data:   1600000 bytes
  Size/request: 16 bytes

Response time histogram:
  0.000 [1] |
  0.008 [96182] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.016 [1048]  |
  0.023 [858]   |
  0.031 [1740]  |■
  0.039 [102]   |
  0.047 [20]    |
  0.054 [41]    |
  0.062 [5] |
  0.070 [1] |
  0.078 [2] |


Latency distribution:
  10% in 0.0002 secs
  25% in 0.0003 secs
  50% in 0.0005 secs
  75% in 0.0012 secs
  90% in 0.0029 secs
  95% in 0.0053 secs
  99% in 0.0259 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0001 secs, 0.0778 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0350 secs
  resp wait:    0.0015 secs, 0.0001 secs, 0.0768 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0492 secs

Status code distribution:
  [200] 100000 responses



==> hit it for 30s
Running 30s test @ http://127.0.0.1:8080/helloWorld
  10 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.59ms    3.44ms 158.82ms   97.15%
    Req/Sec     8.51k   831.73    17.55k    78.08%
  2546242 requests in 30.10s, 361.15MB read
Requests/sec:  84591.21
Transfer/sec:     12.00MB
==> Last simple request
HTTP/1.1 200 OK
Date: Fri, 22 May 2020 06:06:57 GMT
connection: keep-alive
content-length: 17
content-type: application/json

Request # 2846333

Total time in seconds: 71